ahtn/keyplus/ports/efm8/efm8/mcu/C8051F380/inc/SI_C8051F380_Register_Enums.h
#define CPT1CN_CPOUT__BMASK                0x40 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__SHIFT                0x06 ///< Comparator Output State Flag                      
#define CPT1CN_CPOUT__POS_LESS_THAN_NEG    0x00 ///< Voltage on CP1P < CP1N.                           
#define CPT1CN_CPOUT__POS_GREATER_THAN_NEG 0x40 ///< Voltage on CP1P > CP1N.                           
                                                                                                       
#define CPT1CN_CPEN__BMASK                 0x80 ///< Comparator Enable                                 
#define CPT1CN_CPEN__SHIFT                 0x07 ///< Comparator Enable                                 
#define CPT1CN_CPEN__DISABLED              0x00 ///< Comparator disabled.                              
#define CPT1CN_CPEN__ENABLED               0x80 ///< Comparator enabled.                               
                                                                                                       
//------------------------------------------------------------------------------
// CPT1MD Enums (Comparator 1 Mode @ 0x9C)
//------------------------------------------------------------------------------
#define CPT1MD_CPMD__FMASK              0x03 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__SHIFT              0x00 ///< Comparator Mode Select                      
#define CPT1MD_CPMD__MODE0              0x00 ///< Mode 0 (Fastest Response Time, Highest Power
                                             ///< Consumption)                                
#define CPT1MD_CPMD__MODE1              0x01 ///< Mode 1                                      
#define CPT1MD_CPMD__MODE2              0x02 ///< Mode 2                                      
#define CPT1MD_CPMD__MODE3              0x03 ///< Mode 3 (Slowest Response Time, Lowest Power 
                                             ///< Consumption)                                
                                                                                              
#define CPT1MD_CPFIE__BMASK             0x10 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__SHIFT             0x04 ///< Comparator Falling-Edge Interrupt Enable    
#define CPT1MD_CPFIE__FALL_INT_DISABLED 0x00 ///< Comparator falling-edge interrupt disabled. 
#define CPT1MD_CPFIE__FALL_INT_ENABLED  0x10 ///< Comparator falling-edge interrupt enabled.  
                                                                                              
#define CPT1MD_CPRIE__BMASK             0x20 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__SHIFT             0x05 ///< Comparator Rising-Edge Interrupt Enable     
#define CPT1MD_CPRIE__RISE_INT_DISABLED 0x00 ///< Comparator rising-edge interrupt disabled.  
#define CPT1MD_CPRIE__RISE_INT_ENABLED  0x20 ///< Comparator rising-edge interrupt enabled.   
                                                                                              
//------------------------------------------------------------------------------
// CPT1MX Enums (Comparator 1 Multiplexer Selection @ 0x9E)
//------------------------------------------------------------------------------
#define CPT1MX_CMXP__FMASK  0x07 ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__SHIFT  0x00 ///< Comparator Positive Input MUX Selection
#define CPT1MX_CMXP__CMP1P0 0x00 ///< External pin CMP1P.0.                  
#define CPT1MX_CMXP__CMP1P1 0x01 ///< External pin CMP1P.1.                  
#define CPT1MX_CMXP__CMP1P2 0x02 ///< External pin CMP1P.2.                  
#define CPT1MX_CMXP__CMP1P3 0x03 ///< External pin CMP1P.3.                  
#define CPT1MX_CMXP__CMP1P4 0x04 ///< External pin CMP1P.4.                  
#define CPT1MX_CMXP__NONE   0x0F ///< No input selected.                     
                                                                             
#define CPT1MX_CMXN__FMASK  0x70 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__SHIFT  0x04 ///< Comparator Negative Input MUX Selection
#define CPT1MX_CMXN__CMP1N0 0x00 ///< External pin CMP1N.0.                  
#define CPT1MX_CMXN__CMP1N1 0x10 ///< External pin CMP1N.1.                  
#define CPT1MX_CMXN__CMP1N2 0x20 ///< External pin CMP1N.2.                  
#define CPT1MX_CMXN__CMP1N3 0x30 ///< External pin CMP1N.3.                  
#define CPT1MX_CMXN__CMP1N4 0x40 ///< External pin CMP1N.4.                  
#define CPT1MX_CMXN__NONE   0xF0 ///< No input selected.                     
                                                                             
//------------------------------------------------------------------------------
// IT01CF Enums (INT0/INT1 Configuration @ 0xE4)
//------------------------------------------------------------------------------
#define IT01CF_IN0SL__FMASK       0x07 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__SHIFT       0x00 ///< INT0 Port Pin Selection   
#define IT01CF_IN0SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN0SL__P0_1        0x01 ///< Select P0.1.              
#define IT01CF_IN0SL__P0_2        0x02 ///< Select P0.2.              
#define IT01CF_IN0SL__P0_3        0x03 ///< Select P0.3.              
#define IT01CF_IN0SL__P0_4        0x04 ///< Select P0.4.              
#define IT01CF_IN0SL__P0_5        0x05 ///< Select P0.5.              
#define IT01CF_IN0SL__P0_6        0x06 ///< Select P0.6.              
#define IT01CF_IN0SL__P0_7        0x07 ///< Select P0.7.              
                                                                      
#define IT01CF_IN0PL__BMASK       0x08 ///< INT0 Polarity             
#define IT01CF_IN0PL__SHIFT       0x03 ///< INT0 Polarity             
#define IT01CF_IN0PL__ACTIVE_LOW  0x00 ///< INT0 input is active low. 
#define IT01CF_IN0PL__ACTIVE_HIGH 0x08 ///< INT0 input is active high.
                                                                      
#define IT01CF_IN1SL__FMASK       0x70 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__SHIFT       0x04 ///< INT1 Port Pin Selection   
#define IT01CF_IN1SL__P0_0        0x00 ///< Select P0.0.              
#define IT01CF_IN1SL__P0_1        0x10 ///< Select P0.1.              
#define IT01CF_IN1SL__P0_2        0x20 ///< Select P0.2.              
#define IT01CF_IN1SL__P0_3        0x30 ///< Select P0.3.              
#define IT01CF_IN1SL__P0_4        0x40 ///< Select P0.4.              
#define IT01CF_IN1SL__P0_5        0x50 ///< Select P0.5.              
#define IT01CF_IN1SL__P0_6        0x60 ///< Select P0.6.              
#define IT01CF_IN1SL__P0_7        0x70 ///< Select P0.7.              
                                                                      
#define IT01CF_IN1PL__BMASK       0x80 ///< INT1 Polarity             
#define IT01CF_IN1PL__SHIFT       0x07 ///< INT1 Polarity             
#define IT01CF_IN1PL__ACTIVE_LOW  0x00 ///< INT1 input is active low. 
#define IT01CF_IN1PL__ACTIVE_HIGH 0x80 ///< INT1 input is active high.
                                                                      
//------------------------------------------------------------------------------
// OSCXCN Enums (External Oscillator Control @ 0xB1)
//------------------------------------------------------------------------------
#define OSCXCN_XFCN__FMASK           0x07 ///< External Oscillator Frequency Control            
#define OSCXCN_XFCN__SHIFT           0x00 ///< External Oscillator Frequency Control            
#define OSCXCN_XFCN__MODE0           0x00 ///< Select external oscillator mode 0: Crystal       
                                          ///< frequency <= 20 kHz, RC/C frequency <= 25 kHz, C 
                                          ///< mode K factor = 0.87.                            
#define OSCXCN_XFCN__MODE1           0x01 ///< Select external oscillator mode 1: 20 kHz <      
                                          ///< Crystal frequency <= 58 kHz, 25 kHz < RC/C       
                                          ///< frequency <= 50 kHz, C mode K factor = 2.6.      
#define OSCXCN_XFCN__MODE2           0x02 ///< Select external oscillator mode 2: 58 kHz <      
                                          ///< Crystal frequency <= 155 kHz, 50 kHz < RC/C      
                                          ///< frequency <= 100 kHz, C mode K factor = 7.7.     
#define OSCXCN_XFCN__MODE3           0x03 ///< Select external oscillator mode 3: 155 kHz <     
                                          ///< Crystal frequency <= 415 kHz, 100 kHz < RC/C     
                                          ///< frequency <= 200 kHz, C mode K factor = 22.      
#define OSCXCN_XFCN__MODE4           0x04 ///< Select external oscillator mode 4: 415 kHz <     
                                          ///< Crystal frequency <= 1.1 MHz, 200 kHz < RC/C     
                                          ///< frequency <= 400 kHz, C mode K factor = 65.      
#define OSCXCN_XFCN__MODE5           0x05 ///< Select external oscillator mode 5: 1.1 MHz <     
                                          ///< Crystal frequency <= 3.1 MHz, 400 kHz < RC/C     
                                          ///< frequency <= 800 kHz, C mode K factor = 180.     
#define OSCXCN_XFCN__MODE6           0x06 ///< Select external oscillator mode 6: 3.1 MHz <     
                                          ///< Crystal frequency <= 8.2 MHz, 800 kHz < RC/C     
                                          ///< frequency <= 1.6 MHz, C mode K factor = 664.     
#define OSCXCN_XFCN__MODE7           0x07 ///< Select external oscillator mode 7: 8.2 MHz <     
                                          ///< Crystal frequency <= 25 MHz, 1.6 MHz < RC/C      
                                          ///< frequency <= 3.2 MHz, C mode K factor = 1590.    
                                                                                                
#define OSCXCN_XOSCMD__FMASK         0x70 ///< External Oscillator Mode                         
#define OSCXCN_XOSCMD__SHIFT         0x04 ///< External Oscillator Mode                         
#define OSCXCN_XOSCMD__DISABLED      0x00 ///< External Oscillator circuit disabled.            
#define OSCXCN_XOSCMD__CMOS          0x20 ///< External CMOS Clock Mode.                        
#define OSCXCN_XOSCMD__CMOS_DIV_2    0x30 ///< External CMOS Clock Mode with divide by 2 stage. 
#define OSCXCN_XOSCMD__RC_DIV_2      0x40 ///< RC Oscillator Mode with divide by 2 stage.       
#define OSCXCN_XOSCMD__C_DIV_2       0x50 ///< Capacitor Oscillator Mode with divide by 2 stage.
#define OSCXCN_XOSCMD__CRYSTAL       0x60 ///< Crystal Oscillator Mode.                         
#define OSCXCN_XOSCMD__CRYSTAL_DIV_2 0x70 ///< Crystal Oscillator Mode with divide by 2 stage.  
                                                                                                
#define OSCXCN_XCLKVLD__BMASK        0x80 ///< External Oscillator Valid Flag                   
#define OSCXCN_XCLKVLD__SHIFT        0x07 ///< External Oscillator Valid Flag                   
#define OSCXCN_XCLKVLD__NOT_SET      0x00 ///< External Oscillator is unused or not yet stable. 
#define OSCXCN_XCLKVLD__SET          0x80 ///< External Oscillator is running and stable.       
                                                                                                
//------------------------------------------------------------------------------
// FLKEY Enums (Flash Lock and Key @ 0xB7)
//------------------------------------------------------------------------------
#define FLKEY_FLKEY__FMASK    0xFF ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__SHIFT    0x00 ///< Flash Lock and Key Register                       
#define FLKEY_FLKEY__LOCKED   0x00 ///< Flash is write/erase locked.                      
#define FLKEY_FLKEY__FIRST    0x01 ///< The first key code has been written (0xA5).       
#define FLKEY_FLKEY__UNLOCKED 0x02 ///< Flash is unlocked (writes/erases allowed).        
#define FLKEY_FLKEY__DISABLED 0x03 ///< Flash writes/erases disabled until the next reset.
#define FLKEY_FLKEY__KEY1     0xA5 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
#define FLKEY_FLKEY__KEY2     0xF1 ///< Flash writes and erases are enabled by writing    
                                   ///< 0xA5 followed by 0xF1 to the FLKEY register.      
                                                                                          
//------------------------------------------------------------------------------
// FLSCL Enums (Flash Scale @ 0xB6)
//------------------------------------------------------------------------------
#define FLSCL_FLRT__BMASK               0x10 ///< Flash Read Timing                       
#define FLSCL_FLRT__SHIFT               0x04 ///< Flash Read Timing                       
#define FLSCL_FLRT__SYSCLK_BELOW_25_MHZ 0x00 ///< SYSCLK <= 25 MHz.                       
#define FLSCL_FLRT__SYSCLK_BELOW_48_MHZ 0x10 ///< SYSCLK <= 48 MHz.                       
                                                                                          
#define FLSCL_FOSE__BMASK               0x80 ///< Flash One-Shot Enable                   
#define FLSCL_FOSE__SHIFT               0x07 ///< Flash One-Shot Enable                   
#define FLSCL_FOSE__DISABLED            0x00 ///< Disable the flash one-shot.             
#define FLSCL_FOSE__ENABLED             0x80 ///< Enable the flash one-shot (recommended).
                                                                                          
//------------------------------------------------------------------------------
// PSCTL Enums (Program Store Control @ 0x8F)
//------------------------------------------------------------------------------
#define PSCTL_PSWE__BMASK          0x01 ///< Program Store Write Enable                      
#define PSCTL_PSWE__SHIFT          0x00 ///< Program Store Write Enable                      
#define PSCTL_PSWE__WRITE_DISABLED 0x00 ///< Writes to flash program memory disabled.        
#define PSCTL_PSWE__WRITE_ENABLED  0x01 ///< Writes to flash program memory enabled; the MOVX
                                        ///< write instruction targets flash memory.         
                                                                                             
