ahtn/keyplus/ports/efm8/efm8/mcu/C8051F380/inc/SI_C8051F380_Register_Enums.h
#define SCON0_MCE__BMASK            0x20 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__SHIFT            0x05 ///< Multiprocessor Communication Enable              
#define SCON0_MCE__MULTI_DISABLED   0x00 ///< Ignore level of 9th bit / Stop bit.              
#define SCON0_MCE__MULTI_ENABLED    0x20 ///< RI is set and an interrupt is generated only when
                                         ///< the stop bit is logic 1 (Mode 0) or when the 9th 
                                         ///< bit is logic 1 (Mode 1).                         
                                                                                               
#define SCON0_SMODE__BMASK          0x80 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__SHIFT          0x07 ///< Serial Port 0 Operation Mode                     
#define SCON0_SMODE__8_BIT          0x00 ///< 8-bit UART with Variable Baud Rate (Mode 0).     
#define SCON0_SMODE__9_BIT          0x80 ///< 9-bit UART with Variable Baud Rate (Mode 1).     
                                                                                               
//------------------------------------------------------------------------------
// SBCON1 Enums (UART1 Baud Rate Generator Control @ 0xAC)
//------------------------------------------------------------------------------
#define SBCON1_SBPS__FMASK     0x03 ///< Baud Rate Prescaler Select                     
#define SBCON1_SBPS__SHIFT     0x00 ///< Baud Rate Prescaler Select                     
#define SBCON1_SBPS__DIV_BY_12 0x00 ///< Prescaler = 12.                                
#define SBCON1_SBPS__DIV_BY_4  0x01 ///< Prescaler = 4.                                 
#define SBCON1_SBPS__DIV_BY_48 0x02 ///< Prescaler = 48.                                
#define SBCON1_SBPS__DIV_BY_1  0x03 ///< Prescaler = 1.                                 
                                                                                        
#define SBCON1_SBRUN__BMASK    0x40 ///< Baud Rate Generator Enable                     
#define SBCON1_SBRUN__SHIFT    0x06 ///< Baud Rate Generator Enable                     
#define SBCON1_SBRUN__DISABLED 0x00 ///< Disable the baud rate generator. UART1 will not
                                    ///< function.                                      
#define SBCON1_SBRUN__ENABLED  0x40 ///< Enable the baud rate generator.                
                                                                                        
//------------------------------------------------------------------------------
// SBRLH1 Enums (UART1 Baud Rate Generator High Byte @ 0xB5)
//------------------------------------------------------------------------------
#define SBRLH1_SBRL__FMASK 0xFF ///< UART1 Baud Rate Reload High
#define SBRLH1_SBRL__SHIFT 0x00 ///< UART1 Baud Rate Reload High
                                                                
//------------------------------------------------------------------------------
// SBRLL1 Enums (UART1 Baud Rate Generator Low Byte @ 0xB4)
//------------------------------------------------------------------------------
#define SBRLL1_SBRL__FMASK 0xFF ///< UART1 Baud Rate Reload Low
#define SBRLL1_SBRL__SHIFT 0x00 ///< UART1 Baud Rate Reload Low
                                                               
//------------------------------------------------------------------------------
// SBUF1 Enums (UART1 Serial Port Data Buffer @ 0xD3)
//------------------------------------------------------------------------------
#define SBUF1_SBUF1__FMASK 0xFF ///< Serial Port Data Buffer
#define SBUF1_SBUF1__SHIFT 0x00 ///< Serial Port Data Buffer
                                                            
//------------------------------------------------------------------------------
// SCON1 Enums (UART1 Serial Port Control @ 0xD2)
//------------------------------------------------------------------------------
#define SCON1_RI__BMASK             0x01 ///< Receive Interrupt Flag                            
#define SCON1_RI__SHIFT             0x00 ///< Receive Interrupt Flag                            
#define SCON1_RI__NOT_SET           0x00 ///< A byte of data has not been received by UART1.    
#define SCON1_RI__SET               0x01 ///< UART1 received a byte of data or data remains in  
                                         ///< the receive FIFO.                                 
                                                                                                
#define SCON1_TI__BMASK             0x02 ///< Transmit Interrupt Flag                           
#define SCON1_TI__SHIFT             0x01 ///< Transmit Interrupt Flag                           
#define SCON1_TI__NOT_SET           0x00 ///< A byte of data has not been transmitted by UART1. 
#define SCON1_TI__SET               0x02 ///< UART1 transmitted a byte of data.                 
                                                                                                
#define SCON1_RBX__BMASK            0x04 ///< Extra Receive Bit                                 
#define SCON1_RBX__SHIFT            0x02 ///< Extra Receive Bit                                 
#define SCON1_RBX__LOW              0x00 ///< The extra bit or the first stop bit is 0.         
#define SCON1_RBX__HIGH             0x04 ///< The extra bit or the first stop bit is 1.         
                                                                                                
#define SCON1_TBX__BMASK            0x08 ///< Extra Transmission Bit                            
#define SCON1_TBX__SHIFT            0x03 ///< Extra Transmission Bit                            
#define SCON1_TBX__LOW              0x00 ///< Set extra bit to 0 (low).                         
#define SCON1_TBX__HIGH             0x08 ///< Set extra bit to 1 (high).                        
                                                                                                
#define SCON1_REN__BMASK            0x10 ///< Receive Enable                                    
#define SCON1_REN__SHIFT            0x04 ///< Receive Enable                                    
#define SCON1_REN__RECEIVE_DISABLED 0x00 ///< UART1 reception disabled.                         
#define SCON1_REN__RECEIVE_ENABLED  0x10 ///< UART1 reception enabled.                          
                                                                                                
#define SCON1_THRE__BMASK           0x20 ///< Transmit Holding Register Empty Flag              
#define SCON1_THRE__SHIFT           0x05 ///< Transmit Holding Register Empty Flag              
#define SCON1_THRE__NOT_SET         0x00 ///< The transmit holding register is not empty. Do not
                                         ///< write to SBUF1.                                   
#define SCON1_THRE__SET             0x20 ///< The transmit holding register is empty. It is safe
                                         ///< to write to SBUF1.                                
                                                                                                
#define SCON1_PERR__BMASK           0x40 ///< Parity Error Flag                                 
#define SCON1_PERR__SHIFT           0x06 ///< Parity Error Flag                                 
#define SCON1_PERR__NOT_SET         0x00 ///< Parity error has not occurred.                    
#define SCON1_PERR__SET             0x40 ///< Parity error has occurred.                        
                                                                                                
